# **Beyond** the Basics üêº

In [1]:
import pandas as pd

### Creating a sample DataFrame

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Birthdate': ['1995-01-01', '1990-05-15', '1985-09-30']}
df = pd.DataFrame(data)

df.head()

      Name  Age   Birthdate
0    Alice   25  1995-01-01
1      Bob   30  1990-05-15
2  Charlie   35  1985-09-30

### **Puzzle 1**
Select rows where a column's value is in a list.

In [3]:
df.loc[df['Name'].isin(['Alice', 'Charlie'])]

      Name  Age   Birthdate
0    Alice   25  1995-01-01
2  Charlie   35  1985-09-30

### **Puzzle 2**
Apply a function to each row.

In [4]:
df['Age_Doubled'] = df['Age'].apply(lambda x: x * 2)

df

      Name  Age   Birthdate  Age_Doubled
0    Alice   25  1995-01-01           50
1      Bob   30  1990-05-15           60
2  Charlie   35  1985-09-30           70

### **Puzzle 3**
Merge **two** DataFrames on a common column.

In [5]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Age': [25, 30]})
df2 = pd.DataFrame({'Name': ['Alice', 'Bob'], 'City': ['New York', 'Los Angeles']})
df_merged = pd.merge(df1, df2, on='Name')

df_merged

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

### **Puzzle 4**
**_Pivot_** a DataFrame.

In [15]:
df['City'] = ['New York', 'Los Angeles', 'Chicago']
df_pivoted = df.pivot(index='Name', columns='Age', values='City')

df_pivoted

Age            25           30       35
Name
Alice    New York          NaN      NaN
Bob           NaN  Los Angeles      NaN
Charlie       NaN          NaN  Chicago

### **Puzzle 5**
**_Unpivot_** a DataFrame.

In [16]:
df_pivoted.reset_index(inplace=True)
df_unpivoted = df_pivoted.melt(id_vars='Name', var_name='Age', value_name='City').dropna()
df_unpivoted.reset_index(drop=True, inplace=True)

df_unpivoted

      Name Age         City
0    Alice  25     New York
1      Bob  30  Los Angeles
2  Charlie  35      Chicago

### **Puzzle 6**
Replace _missing values_ in a DataFrame.

In [14]:
df_with_na = df.copy()
df_with_na.loc[1, 'Age'] = None
df_with_na.fillna(0, inplace=True)

df_with_na

      Name   Age   Birthdate  Age_Doubled         City
0    Alice  25.0  1995-01-01           50     New York
1      Bob   0.0  1990-05-15           60  Los Angeles
2  Charlie  35.0  1985-09-30           70      Chicago

### **Puzzle 7**
Create a new column based on a condition.

In [15]:
df['Senior'] = df['Age'] > 30

df

      Name  Age   Birthdate  Age_Doubled         City  Senior
0    Alice   25  1995-01-01           50     New York   False
1      Bob   30  1990-05-15           60  Los Angeles   False
2  Charlie   35  1985-09-30           70      Chicago    True

### **Puzzle 8**
Calculate the cumulative sum of a column.

In [16]:
df['Cumulative_Age'] = df['Age'].cumsum()

df

      Name  Age   Birthdate  Age_Doubled         City  Senior  Cumulative_Age
0    Alice   25  1995-01-01           50     New York   False              25
1      Bob   30  1990-05-15           60  Los Angeles   False              55
2  Charlie   35  1985-09-30           70      Chicago    True              90

### **Puzzle 9**
Use `map` to modify all elements of a DataFrame.

In [26]:
df_multiplied = df[['Age']].map(lambda x: x * 2)

df_multiplied

   Age
0   50
1   60
2   70

In [ ]:
# Feel free to code ...